Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (Beam, Point)
 Splits the beam and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Beam Split(
	Beam Object,
	Point SplitPoint
)
Public Shared Function Split (
	Object As Beam,
	SplitPoint As Point
) As Beam
Parameters
Object
Type: Tekla.Structures.Model.Beam
The beam object to be split.
SplitPoint
Type: Tekla.Structures.Geometry3d.Point
The position where splitting is executed.
Return Value
Type: Beam
The created beam on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace